_Rarzrabotki/Kazna/Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бюджеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоБюджета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецБюджета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Секция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Секции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/НаправленияДвиженийДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>НаправленияДвиженийДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/Бюджет/Forms/ФормаДокумента1/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодБюджетаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.НачалоБюджета) ИЛИ Не ЗначениеЗаполнено(Объект.КонецБюджета) Тогда
		Возврат;                                                                                   
	КонецЕсли;

	ОписаниеОповещения	= Новый ОписаниеОповещения("ПериодБюджетаПриИзмененииЗавершение", ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения, "Внимание! Данные о суммах бюджета будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
	
КонецПроцедуры

&НаКлиенте 
Процедура ПериодБюджетаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьКолонкиДат();
		ДобавитьКолонкиДат();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не Объект.Ссылка.Пустая() Тогда
		ДобавитьКолонкиДат();
		ЗаполнитьДеревоПоказателейНаФорме();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПоказателейНаФорме()
	
	СтруктураСоответствийКолонокДатам	= ПолучитьИзВременногоХранилища(АдресХранилищаСтруктурыСоответствийКолонокДат);
	
	Запрос	= Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаДанных", Объект.Показатели.Выгрузить());
	
	ТекстЗапроса	= "Выбрать * ПОМЕСТИТЬ ТаблицаДанных ИЗ &ТаблицаДанных КАК ТаблицаДанных;" + Символы.ПС;
	
	ТекстЗапроса	= ТекстЗапроса + 
						"ВЫБРАТЬ 
						//|	ТаблицаДанных.Подразделение КАК Подразделение,
						|	ТаблицаДанных.Секция КАК Секция,
						|	ТаблицаДанных.СДДС КАК СДДС,
						|	ТаблицаДанных.СДДС.Код КАК Код,
						|	ТаблицаДанных.НаправлениеДДС КАК НаправлениеДДС,
						|	1 КАК УровеньИерархии," + Символы.ПС
						+ ПолучитьДополнениеЗапросаПоМесяцам(Запрос, СтруктураСоответствийКолонокДатам) +  Символы.ПС
						+ " ИЗ ТаблицаДанных
						|	СГРУППИРОВАТЬ ПО
						//|	Подразделение,
						|	Секция,
						|	СДДС,
						|	НаправлениеДДС
						|			
						|	УПОРЯДОЧИТЬ ПО Код
						|	ИТОГИ ПО
						//|	Подразделение,
						|	Секция";
						Запрос.Текст	= ТекстЗапроса;
						
	Дерево	= Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Дерево.Колонки.Добавить("Показатель");
	
	Для Каждого лСтрока_Секция  Из Дерево.Строки Цикл
		лСтрока_Секция.Показатель = лСтрока_Секция.Секция;
		Для Каждого лСтрока_СДДС  	Из лСтрока_Секция.Строки Цикл
			лСтрока_СДДС.Показатель 	= лСтрока_СДДС.СДДС;
			лСтрока_СДДС.НаправлениеДДС = лСтрока_СДДС.НаправлениеДДС;
			лСтрока_СДДС.Код			= лСтрока_СДДС.Код;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоПоказателей");
							
КонецПроцедуры



&НаСервере
Функция ПолучитьДополнениеЗапросаПоМесяцам(Запрос, СтруктураСоответствийКолонокДатам)
	
	ДополнениеТекстаЗапроса	= "";
	СчетчикКолонок			= 1;
	
	Для Каждого Дата Из СтруктураСоответствийКолонокДатам Цикл
		ДополнениеТекстаЗапроса = ДополнениеТекстаЗапроса + " СУММА(ВЫБОР КОГДА НачалоПериода(ТаблицаДанных.Месяц, Месяц) = &Дата" + СчетчикКолонок +" ТОГДА Сумма ИНАЧЕ 0 КОНЕЦ) КАК " + Дата.Ключ + "," + Символы.ПС;
		Запрос.УстановитьПараметр("Дата" + СчетчикКолонок, Дата.Значение);
		СчетчикКолонок = СчетчикКолонок + 1;
	КонецЦикла;
	
	Возврат Лев(ДополнениеТекстаЗапроса, СтрДлина(ДополнениеТекстаЗапроса) - 2);
	
КонецФункции

&НаСервере
Процедура УдалитьКолонкиДат()
	
	Если Не ЗначениеЗаполнено(Объект.НачалоБюджета) ИЛИ Не ЗначениеЗаполнено(Объект.КонецБюджета) Или ПустаяСтрока(АдресХранилищаСтруктурыСоответствийКолонокДат) Тогда
		Возврат;                                                                                   
	КонецЕсли;
	
	СтруктураСоответствийКолонокДатам	= ПолучитьИзВременногоХранилища(АдресХранилищаСтруктурыСоответствийКолонокДат);
	
	ДеревоПоказателейЗначение = РеквизитФормыВЗначение("ДеревоПоказателей", Тип("ДеревоЗначений"));
	
	УсловноеОформление.Элементы.Очистить();
	
	УдаляемыеРеквизиты		= Новый Массив;
	Для Каждого КолонкаДаты Из СтруктураСоответствийКолонокДатам Цикл	
		Элементы.Удалить(Элементы.Найти("ДеревоЗначений" + КолонкаДаты.Ключ));
		УдаляемыеРеквизиты.Добавить("ДеревоПоказателей." + КолонкаДаты.Ключ);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
	Для Каждого КолонкаДаты Из СтруктураСоответствийКолонокДатам Цикл	
		ДеревоПоказателейЗначение.Колонки.Удалить( КолонкаДаты.Ключ );	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиДат()
	
	Если Не ЗначениеЗаполнено(Объект.НачалоБюджета) ИЛИ Не ЗначениеЗаполнено(Объект.КонецБюджета) Тогда
		Возврат;                                                                                   
	КонецЕсли;
	
	СтруктураСоответствийКолонокДатам	= Новый Структура;
	
	ДеревоПоказателейЗначение = РеквизитФормыВЗначение("ДеревоПоказателей", Тип("ДеревоЗначений"));
	
	Дата	= Объект.НачалоБюджета;
	
	СчетчикКолонок 				= 1;
	ДобавляемыеРеквизиты		= Новый Массив;
	Пока Дата <= Объект.КонецБюджета Цикл
		ДеревоПоказателейЗначение.Колонки.Добавить("Колонка" + СчетчикКолонок);
		СтруктураСоответствийКолонокДатам.Вставить("Колонка" + СчетчикКолонок, Дата);
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка" + СчетчикКолонок, Новый ОписаниеТипов("Число"), "ДеревоПоказателей"));
		
		Дата = НачалоМесяца(ДобавитьМесяц(Дата, 1));
		СчетчикКолонок = СчетчикКолонок + 1;
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ЗначениеВРеквизитФормы(ДеревоПоказателейЗначение, "ДеревоПоказателей");
	
	Для Счетчик = 1 По СчетчикКолонок - 1 Цикл
		НовыйЭлемент			= ЭтаФорма.Элементы.Добавить("ДеревоЗначенийКолонка" + Счетчик, Тип("ПолеФормы"), Элементы.ДеревоПоказателей);
		НовыйЭлемент.Вид		= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок	= Формат(СтруктураСоответствийКолонокДатам["Колонка" + Счетчик], "ДФ='MMMM yy'");
		НовыйЭлемент.ПутьКДанным = "ДеревоПоказателей.Колонка" +  Счетчик;
	КонецЦикла;
	
	
	АдресХранилищаСтруктурыСоответствийКолонокДат = ПоместитьВоВременноеХранилище(СтруктураСоответствийКолонокДатам, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПерезаполнитьТЧПоказателей(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТЧПоказателей(ТекущийОбъект)
	
	СтруктураСоответствийКолонокДатам	= ПолучитьИзВременногоХранилища(АдресХранилищаСтруктурыСоответствийКолонокДат);
	ДеревоПоказателейЗначение 			= РеквизитФормыВЗначение("ДеревоПоказателей", Тип("ДеревоЗначений"));
	
	ТекущийОбъект.Показатели.Очистить();
	
	Для Каждого лСтрокаСекция Из ДеревоПоказателейЗначение.Строки Цикл 
		Для Каждого лСтрокаСДДС Из лСтрокаСекция.Строки Цикл
			Для Каждого лДаты Из СтруктураСоответствийКолонокДатам Цикл	
				//Если Не лСтрокаСДДС[лДаты.Ключ] = 0 Тогда
					лНовСтрока 					= ТекущийОбъект.Показатели.Добавить();
					лНовСтрока.Секция   		= лСтрокаСекция.Показатель;
					лНовСтрока.СДДС				= лСтрокаСДДС.Показатель;
					лНовСтрока.НаправлениеДДС	= лСтрокаСДДС.НаправлениеДДС;
					лНовСтрока.Сумма			= лСтрокаСДДС[лДаты.Ключ];
					лНовСтрока.Месяц			= лДаты.Значение;
				//КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСекцию(Команда)
	
	ОписаниеОповещения	= Новый ОписаниеОповещения("ДобавитьСекциюЗавершение", ЭтаФорма);
	ПараметрыОткрытия	= Новый Структура("Владелец", Объект.Подразделение);//ТекущаяСтрока.Подразделение);
	ОткрытьФорму("Справочник.Секции.Форма.ФормаВыбораПодчиненныхСекций", ПараметрыОткрытия, ЭтаФорма,,,, ОписаниеОповещения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСекциюЗавершение(Значение, Параметры) Экспорт
	
	лНовСтрока = Неопределено;
	лСтрокиДЗ  = ДеревоПоказателей.ПолучитьЭлементы();
	Для Каждого лСтрока Из лСтрокиДЗ Цикл
		Если лСтрока.Показатель = Значение Тогда 
			лНовСтрока 			= лСтрока;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если лНовСтрока = Неопределено тогда 
		лНовСтрока  			= лСтрокиДЗ.Добавить();
		лНовСтрока.Показатель	= Значение;
	КонецЕсли;
	
	Элементы.ДеревоПоказателей.ТекущаяСтрока = лНовСтрока;

КонецПроцедуры
 
&НаКлиенте
Процедура ДобавитьСДДС(Команда)

	Если Элементы.ДеревоПоказателей.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения	= Новый ОписаниеОповещения("ДобавитьСДДСЗавершение", ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещения, , , Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСДДСЗавершение(Значение, Параметры) Экспорт
	
	Если Элементы.ДеревоПоказателей.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока 			= ДеревоПоказателей.НайтиПоИдентификатору(Элементы.ДеревоПоказателей.ТекущиеДанные.ПолучитьИдентификатор());	
	лНовСтрока 				= ТекущаяСтрока.ПолучитьРодителя();
	лНовСтрока    			= ?( лНовСтрока = Неопределено, ТекущаяСтрока.ПолучитьЭлементы().Добавить(), лНовСтрока.ПолучитьЭлементы().Добавить() );
	лНовСтрока.Показатель 	= Значение;
	лНовСтрока.НаправлениеДДС= ПредопределенноеЗначение("Перечисление.НаправленияДвиженийДенежныхСредств.Расход");
	лНовСтрока.Код			= ПолучитьКодДДС(Значение);
	
	Элементы.ДеревоПоказателей.Развернуть(Элементы.ДеревоПоказателей.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодДДС(Значение)
	Возврат Значение.Код;
КонецФункции
 
&НаКлиенте
Процедура ДеревоПоказателейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		
		ТекущаяСтрока					= ДеревоПоказателей.НайтиПоИдентификатору(Элемент.ТекущиеДанные.ПолучитьИдентификатор());	
		лЭтоСекция  					= ТекущаяСтрока.ПолучитьРодителя() = Неопределено;
		
		ТекущаяСтрока.НаправлениеДДС	= ПредопределенноеЗначение("Перечисление.НаправленияДвиженийДенежныхСредств.Расход");
		
		Элементы.ДеревоПоказателейСДДС.ОграничениеТипа= ?(лЭтоСекция, 
									Новый ОписаниеТипов("СправочникСсылка.Секции"),
									Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
									
									
		ИначеЕсли Копирование = Истина тогда 
									
									
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПоказателейСДДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ТекущаяСтрока					= ДеревоПоказателей.НайтиПоИдентификатору(Элементы.ДеревоПоказателей.ТекущиеДанные.ПолучитьИдентификатор());	
		лЭтоСекция  					= ТекущаяСтрока.ПолучитьРодителя() = Неопределено;
		Элементы.ДеревоПоказателейСДДС.ОграничениеТипа= ?(лЭтоСекция, 
									Новый ОписаниеТипов("СправочникСсылка.Секции"),
									Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
									
		Если  лЭтоСекция Тогда 
			СтандартнаяОбработка = Ложь;							
			ОткрытьФорму("Справочник.Секции.Форма.ФормаВыбораПодчиненныхСекций", 
				Новый Структура("Владелец", Объект.Подразделение), 
				ЭтаФорма,,,, 
				Новый ОписаниеОповещения("ДобавитьСекциюЗавершение_НачалоВыбора", ЭтаФорма)); 
		КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСекциюЗавершение_НачалоВыбора(Значение, Параметры) Экспорт
	
	ТекущаяСтрока	= ДеревоПоказателей.НайтиПоИдентификатору(Элементы.ДеревоПоказателей.ТекущиеДанные.ПолучитьИдентификатор());	
	ТекущаяСтрока.показатель = Значение;

КонецПроцедуры


&НаКлиенте
Процедура ДеревоПоказателейОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	лЭто = Неопределено;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПоказателейСДДСПриИзменении(Элемент)
	ТекущаяСтрока 			= ДеревоПоказателей.НайтиПоИдентификатору(Элементы.ДеревоПоказателей.ТекущиеДанные.ПолучитьИдентификатор());	
	Если ТипЗнч(ТекущаяСтрока.Показатель) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") ТОгда 
		ТекущаяСтрока.Код			= ПолучитьКодДДС(ТекущаяСтрока.Показатель);
	Иначе 
		ТекущаяСтрока.Код			= "";
	КонецЕсли;
КонецПроцедуры
